In [71]:
import numpy as np
import pandas as pd
from scipy.spatial import cKDTree

In [72]:
pm25_2024 = pd.read_csv("new_data/mappm252024g.csv")
msoa = pd.read_csv("new_data/infuse_msoa_lyr_2011.csv")
pm25_2024.head(10)

/tmp/ipykernel_1948/4006805598.py:1: DtypeWarning: Columns (0,1,2,3) have mixed types. Specify dtype option on import or set low_memory=False.
  pm25_2024 = pd.read_csv("new_data/mappm252024g.csv")

         pm2.5 Unnamed: 1 Unnamed: 2 Unnamed: 3
0         2024        NaN        NaN        NaN
1  annual mean        NaN        NaN        NaN
2       ug m-3        NaN        NaN        NaN
3          NaN        NaN        NaN        NaN
4     gridcode          x          y  pm252024g
5        55671     460500    1219500   2.995311
6        56360     459500    1218500   2.990555
7        56361     460500    1218500   2.996322
8        56362     461500    1218500   2.997415
9        56363     462500    1218500   2.998089

In [73]:
pm25_2024.drop(labels=[0,1,2,3,4], inplace=True)

pm25_2024.rename(columns={"pm2.5": "ukgridcode", "Unnamed: 1": "x", "Unnamed: 2": "y", "Unnamed: 3": "pm25_2024"}, inplace=True)

pm25_2024.head(10)

   ukgridcode       x        y pm25_2024
5       55671  460500  1219500  2.995311
6       56360  459500  1218500  2.990555
7       56361  460500  1218500  2.996322
8       56362  461500  1218500  2.997415
9       56363  462500  1218500  2.998089
10      56364  463500  1218500  2.999147
11      57050  459500  1217500   2.99308
12      57051  460500  1217500  2.999035
13      57052  461500  1217500  3.001105
14      57053  462500  1217500   3.00137

In [74]:
pm25_2024["pm25_2024"] = pd.to_numeric(pm25_2024["pm25_2024"], errors="coerce")
pm25_2024 = pm25_2024.astype({"x": "int", "y": "int"})
pm25_2024.head(10)

   ukgridcode       x        y  pm25_2024
5       55671  460500  1219500   2.995311
6       56360  459500  1218500   2.990555
7       56361  460500  1218500   2.996322
8       56362  461500  1218500   2.997415
9       56363  462500  1218500   2.998089
10      56364  463500  1218500   2.999147
11      57050  459500  1217500   2.993080
12      57051  460500  1217500   2.999035
13      57052  461500  1217500   3.001105
14      57053  462500  1217500   3.001370

In [75]:
pm25_2024.sort_values(by=pm25_2024.columns[3], ascending=False).head(10)

       ukgridcode       x       y  pm25_2024
217004     771963  532500  181500   11.27488
217002     771961  530500  181500   11.10024
216729     771285  544500  182500   11.05037
217003     771962  531500  181500   11.01223
217001     771960  529500  181500   10.97158
217005     771964  533500  181500   10.71323
216717     771273  532500  182500   10.70021
217280     772650  529500  180500   10.56973
216716     771272  531500  182500   10.53258
217281     772651  530500  180500   10.52863

In [76]:
pollution_coords = np.vstack((pm25_2024["x"], pm25_2024["y"])).T
pollution_tree = cKDTree(pollution_coords)

msoa_coords = np.vstack((msoa["x"], msoa["y"])).T
dist, idx = pollution_tree.query(msoa_coords, k=1)

msoa["pm25_2024"] = pm25_2024.iloc[idx]["pm25_2024"].values

# Now generalising to do rest of data

In [77]:
pm25_2007 = pd.read_csv("new_data/mappm252007g.csv")
pm10_2007 = pd.read_csv("new_data/mappm102007g.csv")
pm10_2024 = pd.read_csv("new_data/mappm102024g.csv")
no2_2007 = pd.read_csv("new_data/mapno22007.csv")
no2_2024 = pd.read_csv("new_data/mapno22024.csv")

data_dict = {"pm25_2007": pm25_2007, "pm10_2007": pm10_2007, "pm10_2024": pm10_2024, "no2_2007": no2_2007, "no2_2024": no2_2024}

/tmp/ipykernel_1948/2779069622.py:1: DtypeWarning: Columns (0,1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  pm25_2007 = pd.read_csv("new_data/mappm252007g.csv")
/tmp/ipykernel_1948/2779069622.py:2: DtypeWarning: Columns (0,1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  pm10_2007 = pd.read_csv("new_data/mappm102007g.csv")
/tmp/ipykernel_1948/2779069622.py:3: DtypeWarning: Columns (0,1,2,3) have mixed types. Specify dtype option on import or set low_memory=False.
  pm10_2024 = pd.read_csv("new_data/mappm102024g.csv")
/tmp/ipykernel_1948/2779069622.py:4: DtypeWarning: Columns (0,1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  no2_2007 = pd.read_csv("new_data/mapno22007.csv")
/tmp/ipykernel_1948/2779069622.py:5: DtypeWarning: Columns (0,1,2,3) have mixed types. Specify dtype option on import or set low_memory=False.
  no2_2024 = pd.read_csv("new_data/mapno22024.csv")

In [78]:
for key in data_dict:
    data_dict[key].drop(labels=[0,1,2,3,4], inplace=True)
    cols = data_dict[key].columns
    data_dict[key].rename(columns={cols[0]: "ukgridcode", cols[1]: "x", cols[2]: "y", cols[3]: key}, inplace=True)
    data_dict[key][key] = pd.to_numeric(data_dict[key][key], errors="coerce")
    data_dict[key] = data_dict[key].astype({"x": "int", "y": "int"})

In [79]:
for key in data_dict:
    pollution_coords = np.vstack((data_dict[key]["x"], data_dict[key]["y"])).T
    pollution_tree = cKDTree(pollution_coords)

    msoa_coords = np.vstack((msoa["x"], msoa["y"])).T
    dist, idx = pollution_tree.query(msoa_coords, k=1)

    msoa[key] = data_dict[key].iloc[idx][key].values

In [80]:
msoa.head()

,geo_code,geo_label,geo_labelw,label,name,x,y,pm25_2024,pm25_2007,pm10_2007,pm10_2024,no2_2007,no2_2024
0,E02002873,Nottingham 006,NaN,E92000001E06000018E02002873,Nottingham 006,456225.560384,344661.819849,7.702422,10.720420,18.64338,11.95465,22.05027,13.084070
1,E02000793,Richmond upon Thames 010,NaN,E92000001E09000027E02000793,Richmond upon Thames 010,514129.344995,174057.348869,8.492700,13.415840,23.05174,13.04231,31.02554,16.298560
2,E02002661,Kingston upon Hull 010,NaN,E92000001E06000010E02002661,Kingston upon Hull 010,513752.975863,432429.543303,7.248457,9.300502,16.61529,11.91518,17.33395,9.187561
3,E02000077,Bexley 013,NaN,E92000001E09000004E02000077,Bexley 013,546964.391181,176424.834342,8.657308,12.638760,22.06381,13.38199,28.51846,14.747010
4,E02000818,Southwark 012,NaN,E92000001E09000028E02000818,Southwark 012,532548.547203,178585.008131,9.819899,15.081210,27.67150,16.87792,47.45792,24.163360

In [81]:
cols = msoa.columns
msoa = msoa.drop([cols[2], cols[3], cols[4]], axis=1)

msoa.head()

,geo_code,geo_label,x,y,pm25_2024,pm25_2007,pm10_2007,pm10_2024,no2_2007,no2_2024
0,E02002873,Nottingham 006,456225.560384,344661.819849,7.702422,10.720420,18.64338,11.95465,22.05027,13.084070
1,E02000793,Richmond upon Thames 010,514129.344995,174057.348869,8.492700,13.415840,23.05174,13.04231,31.02554,16.298560
2,E02002661,Kingston upon Hull 010,513752.975863,432429.543303,7.248457,9.300502,16.61529,11.91518,17.33395,9.187561
3,E02000077,Bexley 013,546964.391181,176424.834342,8.657308,12.638760,22.06381,13.38199,28.51846,14.747010
4,E02000818,Southwark 012,532548.547203,178585.008131,9.819899,15.081210,27.67150,16.87792,47.45792,24.163360